//
#include<iostream>

using std::cout;
using std::cin;
/////////////////////////////////////////////////
struct Distance // длина в английской системе
{
	int feel;
	float inches;
};
////////////////////////////////////////////////

int main()
{
	setlocale(LC_ALL, "");
	Distance d1, d3; // определени€ двух переменных
	Distance d2 = { 11, 6.25 }; // определение с инициализацией
	// ввод полей переменной d1
	cout << "\n¬ведите число футов: ";
	cin >> d1.feel;
	cout << "¬ведите число дюймов: ";
	cin >> d1.inches;
	// сложение длин d1 и d2 и присвоение результата d3
	d3.inches = d1.inches + d2.inches; // сложение дюймов
	d3.feel = 0;			// с возможным заемом
	if (d3.inches >= 12.0)  // если сумма больше 12.0
	{						// то уменьшаем
		d3.inches -= 12.0;  // число дюймов на 12.0 и
		d3.feel++;			// увеличиваем число футов на 1
	}
	d3.feel += d1.feel + d2.feel; // сложение футов
	//вывод всех длин на экран
	cout << d1.feel << "\'-" << d1.inches << "\" + ";
	cout << d2.feel << "\'-" << d2.inches << "\" = ";
	cout << d3.feel << "\'-" << d3.inches << "\"\n";
	return 0;
}